Core/src/Documents/СписаниеТопливаЗапасов/СписаниеТопливаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТопливаЗапасов</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаОСиТС</registerRecords>
  <registerRecords>InformationRegister.ДанныеПоРасходуТС</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСписаниеТопливаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьСДатойДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВА</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегНачало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегОкончание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегРазница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйБак</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/СостоянияВнеоборотныхАктивов/СостоянияВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияВнеоборотныхАктивов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизациюВТекущемМесяце</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВнеоборотныхАктивов</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасход</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/СостоянияВнеоборотныхАктивов/СостоянияВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВнеоборотныхАктивов</name>
  <enumValues>
    <name>ПринятКУчету</name>
  </enumValues>
  <enumValues>
    <name>СнятСУчета</name>
  </enumValues>
  <enumValues>
    <name>НеПринятКУчету</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктурныеЕдиницы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОсновноеПодразделение</name>
      <description>Основное подразделение</description>
    </items>
    <items>
      <name>ОсновнойСклад</name>
      <description>Основной склад</description>
    </items>
    <items>
      <name>ТранзитныйСклад</name>
      <description>ტრანზიტული საწყობი</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипСтруктурнойЕдиницы</name>
    <type>
      <types>EnumRef.ТипыСтруктурныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрдерныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМОЛ</name>
    <comment>Подпись материально-ответственного лица</comment>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРознице</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценки</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОтходов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяОтходов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРозницеРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценкиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранзитныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Documents/СписаниеТопливаЗапасов/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда 
			Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеТопливаЗапасов.СписаниеТоплива;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьРасходыГруппаТопливо();
	
	
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.СписаниеТопливаЗапасов.ТабличныеЧасти.Расходы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда 
		Объект.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
	КонецЕсли;
	Объект.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
	//ИзменитьНаименованиеТаблицыПолей();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановаитьДоступностьТипаДанныхВА();
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвалФормы()
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением)
	
	РазностьДат = УправлениеНебольшойФирмойСервер.ПроверитьНомерДокумента(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"РазностьДат",
		РазностьДат
	);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

&НаСервере
Процедура УстановитьВидимостьРасходыГруппаТопливо()

	ЗначениеВидимости = Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеТопливаЗапасов.СписаниеТоплива;	

	Элементы.РасходыГруппаТопливо.Видимость = ЗначениеВидимости;
	
	Элементы.РасходыЗагрузкаИзФайла.Видимость = ЗначениеВидимости;
	Элементы.РасходыЗагрузкаИзФайлаРемонт.Видимость = НЕ ЗначениеВидимости;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
	УстановитьВидимостьРасходыГруппаТопливо();	
	
	УстановаитьДоступностьТипаДанныхВА();
	
	//ИзменитьНаименованиеТаблицыПолей();	
	
КонецПроцедуры

//&НаСервере
//Процедура ИзменитьНаименованиеТаблицыПолей()
//	
//	ИзменяемаяКолонка=Элементы.Расходы.Колонки.Найти("Себестоимость");
//	Если ИзменяемаяКолонка<>Неопределено Тогда
//		Попытка
//			ИзменяемаяКолонка.Имя="Стоимость";
//		Исключение
//			Сообщить("Недопустимое новое имя колонки или такая колонка уже существует...");
//		КонецПопытки;
//	КонецЕсли;
//	Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеТопливаЗапасов.СписаниеТоплива Тогда 
//		для Каждого стр из Элементы.Расходы.ПодчиненныеЭлементы Цикл 
//			стр.ВнеоборотныйАктив.Заголовок = "სატრანსპორტო საშუალება";
//			стр.НомерВА.Заголовок = "სარეგისტრაციო ნომერი";
//			
//		КонецЦикла;
//	КонецЕсли;	
//КонецПроцедуры	


&НаКлиенте
Процедура УстановаитьДоступностьТипаДанныхВА()
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеТопливаЗапасов.СписаниеЗапасовНаВнеоборотныеАктивы") Тогда 
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.ВнеоборотныеАктивы"));
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов(МассивТипов);

		Элементы.РасходыВнеоборотныйАктив.ОграничениеТипа = ОписаниеТиповКолонка;
		
	Иначе
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.ВнеоборотныеАктивы"));
		МассивТипов.Добавить(Тип("СправочникСсылка.ТранспортныеСредства"));
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов(МассивТипов);
		
		Элементы.РасходыВнеоборотныйАктив.ОграничениеТипа = ОписаниеТиповКолонка;

	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеДеятельностиПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("СтранаПроисхождения", СтруктураДанные.Номенклатура.СтранаПроисхождения);
	СтруктураДанные.Вставить("ЭтоЗапас", СтруктураДанные.Номенклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаКлиенте
Процедура РасходыХарактеристикаПриИзменении(Элемент)
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыЕдиницаИзмеренияПриИзменении(Элемент)
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	Если НоваяСтрока И НЕ Копирование Тогда 
		
		СтрокаТабличнойЧасти.Дата = НачалоДня(ДатаДокумента);
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница;
		СтрокаТабличнойЧасти.Подразделение = Объект.Подразделение;
		СтрокаТабличнойЧасти.НаправлениеДеятельности = Объект.НаправлениеДеятельности;
		СтрокаТабличнойЧасти.СчетУчетаЗатрат = Объект.СчетУчетаЗатрат;      
		
	КонецЕсли;
	
	Если Объект.ВидОперации =ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеТопливаЗапасов.СписаниеЗапасовНаВнеоборотныеАктивы") Тогда 
		МассивПринятыхВА = МассивПринятыхВА();
		НовыйПараметрСсылки = Новый ПараметрВыбора("Отбор.Ссылка", МассивПринятыхВА);
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметрСсылки);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.РасходыВнеоборотныйАктив.ПараметрыВыбора = НовыеПараметры;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруИнвГосНомера(ВнеоборотныйАктив)
	
	СтруктураВозврата = Новый Структура;
	
	Если ТипЗнч(ВнеоборотныйАктив) = Тип("СправочникСсылка.ВнеоборотныеАктивы") 
		ИЛИ ТипЗнч(ВнеоборотныйАктив) = Тип("СправочникСсылка.ТранспортныеСредства") Тогда 
		СтруктураВозврата.Вставить("Номер", ВнеоборотныйАктив.Код);
	Иначе
		СтруктураВозврата.Вставить("Номер", "");
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура РасходыВнеоборотныйАктивПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтруктураНомера = ПолучитьСтруктуруИнвГосНомера(СтрокаТабличнойЧасти.ВнеоборотныйАктив);
	
	СтрокаТабличнойЧасти.НомерВА = СтруктураНомера.Номер;
	
	Если Объект.ВидОперации =ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеТопливаЗапасов.СписаниеЗапасовНаВнеоборотныеАктивы") Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаТабличнойЧасти.ВнеоборотныйАктив) = Тип("СправочникСсылка.ВнеоборотныеАктивы") Тогда 
		
		МассивПринятыхВА = МассивПринятыхВА();
		НовыйПараметрСсылки = Новый ПараметрВыбора("Отбор.Ссылка", МассивПринятыхВА);
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметрСсылки);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.РасходыВнеоборотныйАктив.ПараметрыВыбора = НовыеПараметры;
		
	Иначе
		
		МассивПринятыхВА = МассивПринятыхВА();
		НовыйПараметрСсылки = Новый ПараметрВыбора("Отбор.ПометкаУдаления", ЛОЖЬ);
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметрСсылки);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.РасходыВнеоборотныйАктив.ПараметрыВыбора = НовыеПараметры;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПробегНачалоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	РасчитатьРазницуПробегу(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПробегОкончаниеПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	РасчитатьРазницуПробегу(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьРазницуПробегу(СтрокаТЧ)

	Если СтрокаТЧ.ПробегНачало <> 0 И СтрокаТЧ.ПробегОкончание <> 0 Тогда 
		СтрокаТЧ.ПробегРазница = СтрокаТЧ.ПробегОкончание - СтрокаТЧ.ПробегНачало;
	Иначе
		СтрокаТЧ.ПробегРазница = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасходыПробегРазникаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Расходы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.ПробегОкончание = СтрокаТабличнойЧасти.ПробегНачало + СтрокаТабличнойЧасти.ПробегРазница;
	
КонецПроцедуры

&НаКлиенте
Процедура КоментариПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура КоментариНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыВнеоборотныйАктивНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаСервере
Функция МассивПринятыхВА()

	ДатаЗапроса = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив
		|ИЗ
		|	РегистрСведений.СостоянияВнеоборотныхАктивов.СрезПоследних(&НаДату, ) КАК СостоянияВнеоборотныхАктивовСрезПоследних
		|ГДЕ
		|	СостоянияВнеоборотныхАктивовСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВнеоборотныхАктивов.ПринятКУчету)";
	
	Запрос.УстановитьПараметр("НаДату", ДатаЗапроса);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВнеоборотныйАктив");
	

КонецФункции // МассивПринятыхВА()()

&НаКлиенте
Процедура ЗагрузкаИзФайлаРасходы(Команда)
	
	НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Документ.СписаниеТопливаЗапасов.ТабличнаяЧасть.Расходы";
	
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяТабличнойЧасти", "ПриходнаяНакладная.Запасы");
	НастройкиЗагрузкиДанных.Вставить("ИмяМакетаСШаблоном","ЗагрузкаИзФайлаЗапасы");
	НастройкиЗагрузкиДанных.Вставить("Заголовок", НСтр("ka='მარაგების ჩატვირთვა ფაილიდან';ru='Загрузка запасов из файла';en='Download the file from the reserves'"));
	НастройкиЗагрузкиДанных.Вставить("СодержаниеВидимо", Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			ОбработатьПодготовленныеДанные(РезультатЗагрузки);
			ОбновитьПодвалФормы();
			
		КонецЕсли;
		
	Иначе
		
		ТипЗагрузки = ?(ДополнительныеПараметры.ПолноеИмяОбъектаЗаполнения = "Документ.СписаниеТопливаЗапасов.ТабличнаяЧасть.Расходы", "Услуги", "Запасы");
		ЗагрузитьИзФайлаЗавершение(РезультатЗагрузки, ТипЗагрузки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодготовленныеДанные(РезультатЗагрузки)
	
	ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
	
	ЗагрузитьДанныеВТабличноеПолеРасходы(ТаблицаСопоставленияДанных);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

&НаСервере
Процедура ЗагрузитьДанныеВТабличноеПолеРасходы(ТаблицаСопоставленияДанных)
	
	Попытка
		
		НачатьТранзакцию();
			
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				НоваяСтрока = Объект.Расходы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				
				//НоваяСтрока.Цена = СтрокаТаблицы.Цена;
				НоваяСтрока.Количество = СтрокаТаблицы.Количество;
				
				Если НЕ ЗначениеЗаполнено(НоваяСтрока.Подразделение) Тогда 
					НоваяСтрока.Подразделение = Объект.Подразделение;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(НоваяСтрока.Дата) Тогда 
					НоваяСтрока.Дата = НачалоДня(Объект.Дата);
				КонецЕсли;
				
				НоваяСтрока.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница;
				НоваяСтрока.НаправлениеДеятельности = Объект.НаправлениеДеятельности;
				НоваяСтрока.СчетУчетаЗатрат = Объект.СчетУчетаЗатрат;
				
				НоваяСтрока.ПробегОкончание = НоваяСтрока.ПробегНачало + НоваяСтрока.ПробегРазница;
				
				СтруктураНомера = ПолучитьСтруктуруИнвГосНомера(НоваяСтрока.ВнеоборотныйАктив);
	
				НоваяСтрока.НомерВА = СтруктураНомера.Номер;
	
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ka='მონაცემების ჩატვირთვა';ru='Загрузка данных';en='Loading data'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Номенклатура, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

// СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла
&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныйПараметр) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных, ДополнительныйПараметр);
	
	Для каждого СтрокаТаблицы Из Объект.Расходы Цикл 
		РассчитатьСуммуВСтрокеТабличнойЧасти("Расходы", СтрокаТаблицы);
	КонецЦикла;
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных, ТипЗагрузки)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	ТоварыДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗагрузки = "Услуги" Тогда
			Если СтрокаТаблицы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрокаТовары = Объект.Расходы.Добавить();
			НоваяСтрокаТовары.НаправлениеДеятельности = СтрокаТаблицы.НаправлениеДеятельности;
		Иначе
			Если СтрокаТаблицы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрокаТовары = Объект.Запасы.Добавить();
			НоваяСтрокаТовары.Характеристика = СтрокаТаблицы.Характеристика;
			НоваяСтрокаТовары.Партия = СтрокаТаблицы.Партия;
		КонецЕсли;
		
		НоваяСтрокаТовары.Номенклатура = СтрокаТаблицы.Номенклатура;
		//НоваяСтрокаТовары.Цена = СтрокаТаблицы.Цена;
		НоваяСтрокаТовары.Количество = СтрокаТаблицы.Количество;
		НоваяСтрокаТовары.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
		
		//Если ЗначениеЗаполнено(СтрокаТаблицы.СтавкаНДС) Тогда
		//	НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
		//Иначе
		//	НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.Номенклатура.СтавкаНДС;
		//КонецЕсли;
		
		ТоварыДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТоварыДобавлены Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТабличнойЧасти = Неопределено, ИмяПоля = "")//Паганини Добавленн параметр #3
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	КонецЕсли;
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

&НаКлиенте
Процедура ЗагрузкаИзФайла(Команда)
	
	АдресРасходовВХранилище = ПоместитьРасходыВХранилище();
	ПараметрыЗаполнения = Новый Структура("АдресРасходовВХранилище, СписаниеТоплива", АдресРасходовВХранилище, Истина);
	
	ОткрытьФорму("Документ.СписаниеТопливаЗапасов.Форма.ФормаЗагрузкеИзТабличногоДокумента", ПараметрыЗаполнения, ЭтаФорма, , , , Новый ОписаниеОповещения("ЗаполнениеРасходовЗавершение", ЭтотОбъект, Новый Структура("АдресРасходовВХранилище", АдресРасходовВХранилище)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаИзФайлаРемонт(Команда)
	
	АдресРасходовВХранилище = ПоместитьРасходыВХранилище();
	ПараметрыЗаполнения = Новый Структура("АдресРасходовВХранилище", АдресРасходовВХранилище);
	ПараметрыЗаполнения = Новый Структура("АдресРасходовВХранилище, СписаниеТоплива", АдресРасходовВХранилище, ЛОЖЬ);
	
	ОткрытьФорму("Документ.СписаниеТопливаЗапасов.Форма.ФормаЗагрузкеИзТабличногоДокументаРемонт", ПараметрыЗаполнения, ЭтаФорма, , , , Новый ОписаниеОповещения("ЗаполнениеРасходовЗавершение", ЭтотОбъект, Новый Структура("АдресРасходовВХранилище", АдресРасходовВХранилище)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьРасходыВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.Расходы.Выгрузить(,
			"Дата,
			|ВнеоборотныйАктив,
			|Номенклатура,
			|Характеристика,
			|Количество,
			|ПробегНачало,
			|ПробегОкончание,
			|ПробегРазница,
			|ПолныйБак,
			|СтруктурнаяЕдиница,
			|Подразделение,
			|НаправлениеДеятельности,
			|СчетУчетаЗатрат"),
		УникальныйИдентификатор
	);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнениеРасходовЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    АдресРасходовВХранилище = ДополнительныеПараметры.АдресРасходовВХранилище;
    
    КодВозврата = Результат;
    
    ЗаполнениеРасходовФрагмент(АдресРасходовВХранилище, КодВозврата);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеРасходовФрагмент(Знач АдресРасходовВХранилище, Знач КодВозврата)
	
	ПолучитьПРасходовИзХранилища(АдресРасходовВХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
КонецПроцедуры


&НаСервере
Процедура ПолучитьПРасходовИзХранилища(АдресРасходовВХранилище)
	
	Объект.Расходы.Очистить();
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресРасходовВХранилище);
	
	Для Каждого Строк Из ТаблицаДляЗагрузки Цикл 
		
		НовСтрока = Объект.Расходы.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтрока, Строк);
		
		Если НЕ ЗначениеЗаполнено(НовСтрока.Дата) Тогда 
			НовСтрока.Дата = НачалоДня(ДатаДокумента);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НовСтрока.СтруктурнаяЕдиница) Тогда
			НовСтрока.СтруктурнаяЕдиница = Объект.СтруктурнаяЕдиница;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НовСтрока.Подразделение) Тогда
			НовСтрока.Подразделение = Объект.Подразделение;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НовСтрока.НаправлениеДеятельности) Тогда
			НовСтрока.НаправлениеДеятельности = Объект.НаправлениеДеятельности;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НовСтрока.СчетУчетаЗатрат) Тогда
			НовСтрока.СчетУчетаЗатрат = Объект.СчетУчетаЗатрат;
		КонецЕсли;
		
		СтруктураНомера = ПолучитьСтруктуруИнвГосНомера(НовСтрока.ВнеоборотныйАктив);
		
		НовСтрока.НомерВА = СтруктураНомера.Номер;
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("Организация", Объект.Организация);
		СтруктураДанные.Вставить("Номенклатура", НовСтрока.Номенклатура);
		СтруктураДанные.Вставить("Характеристика", НовСтрока.Характеристика);
		
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		
		НовСтрока.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
		
		Если НовСтрока.ПробегНачало <> 0 И НовСтрока.ПробегОкончание <> 0 Тогда 
			НовСтрока.ПробегРазница = НовСтрока.ПробегОкончание - НовСтрока.ПробегНачало;
		ИначеЕсли НовСтрока.ПробегНачало <> 0 И НовСтрока.ПробегРазница <> 0 Тогда 
			НовСтрока.ПробегОкончание = НовСтрока.ПробегНачало + НовСтрока.ПробегРазница;
		ИначеЕсли НовСтрока.ПробегОкончание <> 0 И НовСтрока.ПробегРазница <> 0 Тогда 
			НовСтрока.ПробегНачало = НовСтрока.ПробегОкончание - НовСтрока.ПробегРазница;
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры
